burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>Cyclic redundancy checks management unit</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DATA</name>
          <displayName>DATA</displayName>
          <description>Data register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>CRC calculation result bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FDATA</name>
          <displayName>FDATA</displayName>
          <description>Free data register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATA</name>
              <description>Free data register bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REV_O</name>
              <description>Reverse output data value in bit order</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REV_I</name>
              <description>Reverse type for input data</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PS</name>
              <description>Size of polynomial</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST</name>
              <description>Software writes and reads.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATA</name>
          <displayName>IDATA</displayName>
          <description>Initialization data register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>IDATA</name>
              <description>Configurable initial CRC data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POLY</name>
          <displayName>POLY</displayName>
          <description>Polynomial register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x04C11DB7</resetValue>
          <fields>
            <field>
              <name>POLY</name>
              <description>User configurable polynomial value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>Debug support</description>
      <groupName>DBGMCU</groupName>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ID</name>
          <displayName>ID</displayName>
          <description>ID code register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <fields>
          <field>
            <name>ID_CODE</name>
            <description>DBG ID code register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>Control register 0</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TIMER16_HOLD</name>
            <description>TIMER 16 hold bit</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER15_HOLD</name>
            <description>TIMER 15 hold bit</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C1_HOLD</name>
            <description>I2C1 hold bit</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C0_HOLD</name>
            <description>I2C0 hold bit</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER13_HOLD</name>
            <description>TIMER 13 hold bit</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER2_HOLD</name>
            <description>TIMER 2 hold bit</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER0_HOLD</name>
            <description>TIMER 0 hold bit</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WWDGT_HOLD</name>
            <description>WWDGT hold bit</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FWDGT_HOLD</name>
            <description>FWDGT hold bit</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STB_HOLD</name>
            <description>Standby mode hold bit</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DSLP_HOLD</name>
            <description>Deep-sleep mode hold bit</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLP_HOLD</name>
            <description>Sleep mode hold bit</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>Control register 1</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>RTC_HOLD</name>
            <description>RTC hold bit</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
