burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral>
    <name>DMA</name>
    <description>DMA controller</description>
    <groupName>DMA</groupName>
    <baseAddress>0x40020000</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>DMA_Channel0</name>
      <value>10</value>
    </interrupt>
    <interrupt>
      <name>DMA_Channel1</name>
      <value>11</value>
    </interrupt>
    <interrupt>
      <name>DMA_Channel2</name>
      <value>12</value>
    </interrupt>
    <registers>
      <register>
        <name>INTF</name>
        <displayName>INTF</displayName>
        <description>DMA interrupt flag register (DMA_INTF)</description>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ERRIF2</name>
            <description>Channel 2 Error flag</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTFIF2</name>
            <description>Channel 2 Half Transfer Finish flag</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FTFIF2</name>
            <description>Channel 2 Full Transfer Finish flag</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GIF2</name>
            <description>Channel 2 Global interrupt flag</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIF1</name>
            <description>Channel 1 Error flag</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTFIF1</name>
            <description>Channel 1 Half Transfer Finish flag</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FTFIF1</name>
            <description>Channel 1 Full Transfer Finish flag</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GIF1</name>
            <description>Channel 1 Global interrupt flag</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIF0</name>
            <description>Channel 0 Error flag</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTFIF0</name>
            <description>Channel 0 Half Transfer Finish flag</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FTFIF0</name>
            <description>Channel 0 Full Transfer Finish flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GIF0</name>
            <description>Channel 0 Global interrupt flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>INTC</name>
        <displayName>INTC</displayName>
        <description>DMA interrupt flag clear register (DMA_INTC)</description>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <access>write-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ERRIFC2</name>
            <description>Channel 2 Error clear</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTFIFC2</name>
            <description>Channel 2 Half Transfer clear</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FTFIFC2</name>
            <description>Channel 2 Full Transfer Finish clear</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GIFC2</name>
            <description>Channel 2 Global interrupt flag clear</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIFC1</name>
            <description>Channel 1 Error clear</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTFIFC1</name>
            <description>Channel 1 Half Transfer clear</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FTFIFC1</name>
            <description>Channel 1 Full Transfer Finish clear</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GIFC1</name>
            <description>Channel 1 Global interrupt flag clear</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIFC0</name>
            <description>Channel 0 Error clear</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTFIFC0</name>
            <description>Channel 0 Half Transfer clear</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FTFIFC0</name>
            <description>Channel 0 Full Transfer Finish clear</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GIFC0</name>
            <description>Channel 0 Global interrupt flag clear</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH0CTL</name>
        <displayName>CH0CTL</displayName>
        <description>DMA channel configuration register (DMA_CH0CTL)</description>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>M2M</name>
            <description>Memory to memory mode</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PRIO</name>
            <description>Priority Level of this channel</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MWIDTH</name>
            <description>Transfer data size of memory</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PWIDTH</name>
            <description>Transfer data size of peripheral</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MNAGA</name>
            <description>Next address generation algorithm of memory</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PNAGA</name>
            <description>Next address generation algorithm of peripheral</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CMEN</name>
            <description>Circular mode enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIR</name>
            <description>Transfer direction</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIE</name>
            <description>Error interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTFIE</name>
            <description>Half Transfer Finish interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FTFIE</name>
            <description>Full Transfer Finish interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH0CNT</name>
        <displayName>CH0CNT</displayName>
        <description>DMA channel 0 counter register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CNT</name>
            <description>Transfer counter</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH0PADDR</name>
        <displayName>CH0PADDR</displayName>
        <description>DMA channel 0 peripheral base address register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral base address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH0MADDR</name>
        <displayName>CH0MADDR</displayName>
        <description>DMA channel 0 memory base address register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>MADDR</name>
            <description>Memory address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH1CTL</name>
        <displayName>CH1CTL</displayName>
        <description>DMA channel configuration register (DMA_CH1CTL)</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>M2M</name>
            <description>Memory to memory mode</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PRIO</name>
            <description>Priority Level of this channel</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MWIDTH</name>
            <description>Transfer data size of memory</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PWIDTH</name>
            <description>Transfer data size of peripheral</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MNAGA</name>
            <description>Next address generation algorithm of memory</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PNAGA</name>
            <description>Next address generation algorithm of peripheral</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CMEN</name>
            <description>Circular mode enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIR</name>
            <description>Transfer direction</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIE</name>
            <description>Error interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTFIE</name>
            <description>Half Transfer Finish interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FTFIE</name>
            <description>Full Transfer Finish interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH1CNT</name>
        <displayName>CH1CNT</displayName>
        <description>DMA channel 1 counter register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CNT</name>
            <description>Transfer counter</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH1PADDR</name>
        <displayName>CH1PADDR</displayName>
        <description>DMA channel 1 peripheral base address register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral base address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH1MADDR</name>
        <displayName>CH1MADDR</displayName>
        <description>DMA channel 1 memory base address register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>MADDR</name>
            <description>Memory address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH2CTL</name>
        <displayName>CH2CTL</displayName>
        <description>DMA channel configuration register (DMA_CH2CTL)</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>M2M</name>
            <description>Memory to memory mode</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PRIO</name>
            <description>Priority Level of this channel</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MWIDTH</name>
            <description>Transfer data size of memory</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PWIDTH</name>
            <description>Transfer data size of peripheral</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MNAGA</name>
            <description>Next address generation algorithm of memory</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PNAGA</name>
            <description>Next address generation algorithm of peripheral</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CMEN</name>
            <description>Circular mode enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIR</name>
            <description>Transfer direction</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIE</name>
            <description>Error interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTFIE</name>
            <description>Half Transfer Finish interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FTFIE</name>
            <description>Full Transfer Finish interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH2CNT</name>
        <displayName>CH2CNT</displayName>
        <description>DMA channel 2 counter register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CNT</name>
            <description>Transfer counter</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH2PADDR</name>
        <displayName>CH2PADDR</displayName>
        <description>DMA channel 2 peripheral base address register</description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral base address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH2MADDR</name>
        <displayName>CH2MADDR</displayName>
        <description>DMA channel 2 memory base address register</description>
        <addressOffset>0x3C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>MADDR</name>
            <description>Memory address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
