burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral>
    <name>DMAMUX</name>
    <description>DMAMUX controller</description>
    <groupName>DMAMUX</groupName>
    <baseAddress>0x40020800</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>DMA_MUX</name>
      <value>33</value>
    </interrupt>
    <registers>
      <register>
        <name>RM_CH0CFG</name>
        <displayName>RM_CH0CFG</displayName>
        <description>Request multiplexer channel x configuration register </description>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SYNCID</name>
            <description>Synchronization input identification</description>
            <bitOffset>24</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>NBR</name>
            <description>Number of DMA requests to forward</description>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNCP</name>
            <description>Synchronization input polarity</description>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SYNCEN</name>
            <description>Synchronization enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EVGEN</name>
            <description>Event generation enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <description>Synchronization overrun interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUXINID</name>
            <description>Multiplexer input identification</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RM_CH1CFG</name>
        <displayName>RM_CH1CFG</displayName>
        <description>Request multiplexer channel x configuration register </description>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SYNCID</name>
            <description>Synchronization input identification</description>
            <bitOffset>24</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>NBR</name>
            <description>Number of DMA requests to forward</description>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNCP</name>
            <description>Synchronization input polarity</description>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SYNCEN</name>
            <description>Synchronization enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EVGEN</name>
            <description>Event generation enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <description>Synchronization overrun interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUXINID</name>
            <description>Multiplexer input identification</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RM_CH2CFG</name>
        <displayName>RM_CH2CFG</displayName>
        <description>Request multiplexer channel x configuration register </description>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SYNCID</name>
            <description>Synchronization input identification</description>
            <bitOffset>24</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>NBR</name>
            <description>Number of DMA requests to forward</description>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNCP</name>
            <description>Synchronization input polarity</description>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SYNCEN</name>
            <description>Synchronization enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EVGEN</name>
            <description>Event generation enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <description>Synchronization overrun interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUXINID</name>
            <description>Multiplexer input identification</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RM_INTF</name>
        <displayName>RM_INTF</displayName>
        <description>Request multiplexer channel interrupt flag register</description>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SOIF2</name>
            <description>Synchronization overrun event flag of request multiplexer channel 2</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SOIF1</name>
            <description>Synchronization overrun event flag of request multiplexer channel 1</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SOIF0</name>
            <description>Synchronization overrun event flag of request multiplexer channel 0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RM_INTC</name>
        <displayName>RM_INTC</displayName>
        <description>Request multiplexer channel interrupt flag clear register</description>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
        <access>write-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SOIFC2</name>
            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 2</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SOIFC1</name>
            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 1</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SOIFC0</name>
            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RG_CH0CFG</name>
        <displayName>RG_CH0CFG</displayName>
        <description>Request generator channel x configuration register </description>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>NBRG</name>
            <description>Number of DMA requests to be generated</description>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>RGTP</name>
            <description>DMA request generator trigger polarity</description>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>RGEN</name>
            <description>DMAMUX request generator channel x enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TOIE</name>
            <description>Trigger overrun interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TID</name>
            <description>Trigger input identification</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RG_CH1CFG</name>
        <displayName>RG_CH1CFG</displayName>
        <description>Request generator channel 1 configuration register </description>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>NBRG</name>
            <description>Number of DMA requests to be generated</description>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>RGTP</name>
            <description>DMA request generator trigger polarity</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>TOIE</name>
            <description>Trigger overrun interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TID</name>
            <description>Trigger input identification</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RG_CH2CFG</name>
        <displayName>RG_CH2CFG</displayName>
        <description>Request generator channel 2 configuration register </description>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>NBRG</name>
            <description>Number of DMA requests to be generated</description>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>RGTP</name>
            <description>DMA request generator trigger polarity</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>TOIE</name>
            <description>Trigger overrun interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TID</name>
            <description>Trigger input identification</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RG_CH3CFG</name>
        <displayName>RG_CH3CFG</displayName>
        <description>Request generator channel x configuration register </description>
        <addressOffset>0x10C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>NBRG</name>
            <description>Number of DMA requests to be generated</description>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>RGTP</name>
            <description>DMA request generator trigger polarity</description>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>RGEN</name>
            <description>DMAMUX request generator channel x enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TOIE</name>
            <description>Trigger overrun interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TID</name>
            <description>Trigger input identification</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RG_INTF</name>
        <displayName>RG_INTF</displayName>
        <description>Request generator interrupt flag register</description>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TOIF3</name>
            <description>Trigger overrun event flag of request generator channel 3</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TOIF2</name>
            <description>Trigger overrun event flag of request generator channel 2</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TOIF1</name>
            <description>Trigger overrun event flag of request generator channel 1</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TOIF0</name>
            <description>Trigger overrun event flag of request generator channel 0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RG_INTC</name>
        <displayName>RG_INTC</displayName>
        <description>Rquest generator interrupt flag clear register</description>
        <addressOffset>0x144</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TOIFC3</name>
            <description>Clear bit for trigger overrun event flag of request generator channel 3</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TOIFC2</name>
            <description>Clear bit for trigger overrun event flag of request generator channel 2</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TOIFC1</name>
            <description>Clear bit for trigger overrun event flag of request generator channel 1</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TOIFC0</name>
            <description>Clear bit for trigger overrun event flag of request generator channel 0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
