burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral>
    <name>FMC</name>
    <description>Flash memory controller</description>
    <groupName>FMC</groupName>
    <baseAddress>0x40022000</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>FMC_GLOBAL</name>
      <value>3</value>
    </interrupt>
    <registers>
      <register>
        <name>WS</name>
        <displayName>WS</displayName>
        <description>Wait state register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00040200</resetValue>
        <fields>
          <field>
            <name>DBGEN</name>
            <description>Debugger enable</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MFPE</name>
            <description>Main flash programmed or empty flag</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ICRST</name>
            <description>IBUS cache reset.</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ICEN</name>
            <description>IBUS cache enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PFEN</name>
            <description>Pre-fetch enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WSCNT</name>
            <description>Wait state counter register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>KEY</name>
        <displayName>KEY</displayName>
        <description>Unlock key register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>KEY</name>
            <description>FMC_CTL unlock register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>OBKEY</name>
        <displayName>OBKEY</displayName>
        <description>Option byte unlock key register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>OBKEY</name>
            <description>FMC_CTL option bytes operation unlock register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Status register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>BUSY</name>
            <description>The flash is busy bit</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OBERR</name>
            <description>Option byte read error bit.</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RPERR</name>
            <description>Read protection error flag bit.</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSTPERR</name>
            <description>Fast programming error flag bit.</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PGSERR</name>
            <description>Program sequence error flag bit.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PGMERR</name>
            <description>Program size not match error flag bit. This bit is set by hardware when program size is a half-word/word access. The only correct programming size is double word.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PGAERR</name>
            <description>Program alignment error flag bit</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WPERR</name>
            <description>Erase / program protection error flag bit.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PGERR</name>
            <description>Program error flag bit</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OPRERR</name>
            <description>Operation error flag bit</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDF</name>
            <description>End of operation flag bit</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0xC0000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>FMC_CTL lock bit</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OBLK</name>
            <description>FMC_OBCTL lock bit</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCR</name>
            <description>Secure-access area enable bit.</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OBRLD</name>
            <description>Option byte reload bit</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RPERRIE</name>
            <description>Read protection error interrupt enable bit</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERRIE</name>
            <description>OPRERR error interrupt enable bit</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDIE</name>
            <description>End of operation interrupt enable bit</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSTPG</name>
            <description>Main flash fast program command bit</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OBSTART</name>
            <description>Send option byte change command to FMC bit.</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>START</name>
            <description>Send erase command to FMC bit</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PN</name>
            <description>Page number selection</description>
            <bitOffset>3</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MER</name>
            <description>Main flash mass erase command bit</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PER</name>
            <description>Main flash page erase command bit</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PG</name>
            <description>Main flash page program command bit</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>OBCTL</name>
        <displayName>OBCTL</displayName>
        <description>Option byte control register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>NRST_MDSEL</name>
            <description>NRST pin mode selection.</description>
            <bitOffset>27</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>nBOOT0</name>
            <description>BOOT0 option bit</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>nBOOT1</name>
            <description>BOOT1 option bit</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SWBT0</name>
            <description>Software BOOT0</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SRAM_ECCEN</name>
            <description>SRAM ECC disable</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HXTAL_REMAP</name>
            <description>HXTAL remapping</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>nWWDG_HW</name>
            <description>Window watchdog configuration bit</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>nFWDG_HW</name>
            <description>Free watchdog configuration bit</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>nRST_STDBY</name>
            <description>Option byte standby reset value</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>nRST_DPSLP</name>
            <description>Option byte deepsleep reset value</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BORF_TH</name>
            <description>BOR threshold at falling VDD supply</description>
            <bitOffset>11</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BORR_TH</name>
            <description>BOR threshold at rising VDD supply</description>
            <bitOffset>9</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BORST_EN</name>
            <description>Brown out reset enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPC</name>
            <description>Security protection level option byte status bits</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DCRP_SADDR0</name>
        <displayName>DCRP_SADDR0</displayName>
        <description>DCRP start address register 0</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DCRP0_SADDR</name>
            <description>DCRP area 0 start address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DCRP_EADDR0</name>
        <displayName>DCRP_EADDR0</displayName>
        <description>DCRP end address register </description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DCRP_EREN</name>
            <description>DCRP area erase enable configuration bit.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DCRP0_EADDR</name>
            <description>DCRP area 0 end address offset</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>WP0</name>
        <displayName>WP0</displayName>
        <description>Write protection area 0 register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>WP0_EADDR</name>
            <description>Write protection area 0 end address offset</description>
            <bitOffset>16</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WP0_SADDR</name>
            <description>Write protection area 0 end address offset</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>WP1</name>
        <displayName>WP1</displayName>
        <description>Write protection area 1 register</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>WP1_EADDR</name>
            <description>Write protection area 1 end address offset</description>
            <bitOffset>16</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WP1_SADDR</name>
            <description>Write protection area 1 start address offset</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DCRP_SADDR1</name>
        <displayName>DCRP_SADDR1</displayName>
        <description>DCRP start address register </description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DCRP1_SADDR</name>
            <description>DCRP area 1 start address offset</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DCRP_EADDR1</name>
        <displayName>DCRP_EADDR1</displayName>
        <description>DCRP end address register </description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DCRP1_EADDR</name>
            <description>DCRP area 1 end address offset</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SCR</name>
        <displayName>SCR</displayName>
        <description>Secure user area register</description>
        <addressOffset>0x80	</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>BOOTLK</name>
            <description>This bit is set to force boot from user Flash area.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCR_PAGE_CNT</name>
            <description>Configure the number of pages in secure user area.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
