burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral>
    <name>FWDGT</name>
    <description>free watchdog timer</description>
    <groupName>FWDGT</groupName>
    <baseAddress>0x40003000</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <registers>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <access>write-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CMD</name>
            <description>Key value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PSC</name>
        <displayName>PSC</displayName>
        <description>Prescaler register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PSC</name>
            <description>Prescaler divider</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RLD</name>
        <displayName>RLD</displayName>
        <description>Reload register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000FFF</resetValue>
        <fields>
          <field>
            <name>RLD</name>
            <description>Watchdog counter reload value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Status register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PUD</name>
            <description>Watchdog prescaler value update</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RUD</name>
            <description>Watchdog counter reload value update</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WUD</name>
            <description>Watchdog counter window value update</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>WND</name>
        <displayName>WND</displayName>
        <description>Window register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000FFF</resetValue>
        <fields>
          <field>
            <name>WND</name>
            <description>Watchdog counter window value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
    </registers>
  </peripheral>
  <peripheral>
    <name>GPIOA</name>
    <description>General-purpose I/Os</description>
    <groupName>GPIO</groupName>
    <baseAddress>0x48000000</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <registers>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>GPIO port control register</description>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0xE8FFFFFF</resetValue>
        <fields>
          <field>
            <name>CTL15</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL14</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL13</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL12</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL11</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL10</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL9</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL8</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL7</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL6</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL5</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL4</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL3</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL2</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL1</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CTL0</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OMODE</name>
        <displayName>OMODE</displayName>
        <description>GPIO port output type register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>OM15</name>
            <description>Port x configuration bit 15</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM14</name>
            <description>Port x configuration bit 14</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM13</name>
            <description>Port x configuration bit 13</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM12</name>
            <description>Port x configuration bit 12</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM11</name>
            <description>Port x configuration bit 11</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM10</name>
            <description>Port x configuration bit 10</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM9</name>
            <description>Port x configuration bit 9</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM8</name>
            <description>Port x configuration bit 8</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM7</name>
            <description>Port x configuration bit 7</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM6</name>
            <description>Port x configuration bit 6</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM5</name>
            <description>Port x configuration bit 5</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM4</name>
            <description>Port x configuration bit 4</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM3</name>
            <description>Port x configuration bit 3</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM2</name>
            <description>Port x configuration bit 2</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM1</name>
            <description>Port x configuration bit 1</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OM0</name>
            <description>Port x configuration bit 0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OSPD</name>
        <displayName>OSPD</displayName>
        <description>GPIO port output speed register </description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00002000</resetValue>
        <fields>
          <field>
            <name>OSPD15</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD14</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD13</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD12</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD11</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD10</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD9</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD8</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD7</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD6</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD5</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD4</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD3</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD2</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD1</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSPD0</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PUD</name>
        <displayName>PUD</displayName>
        <description>GPIO port pull-up/pull-down register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x24000000</resetValue>
        <fields>
          <field>
            <name>PUD15</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD14</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD13</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD12</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD11</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD10</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD9</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD8</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD7</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD6</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD5</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD4</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD3</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD2</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD1</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUD0</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISTAT</name>
        <displayName>ISTAT</displayName>
        <description>GPIO port input data register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ISTAT15</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT14</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT13</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT12</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT11</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT10</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT9</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT8</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT7</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT6</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT5</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT4</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT3</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT2</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT1</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISTAT0</name>
            <description>Port input data (y = 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
