burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
      <register>
        <name>OCTL</name>
        <displayName>OCTL</displayName>
        <description>GPIO port output data register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>OCTL15</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL14</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL13</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL12</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL11</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL10</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL9</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL8</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL7</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL6</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL5</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL4</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL3</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL2</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL1</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCTL0</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BOP</name>
        <displayName>BOP</displayName>
        <description>GPIO port bit set/reset register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <access>write-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CR15</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR14</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR13</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR12</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR11</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR10</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR9</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR8</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR7</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR6</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR5</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR4</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR3</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR2</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR1</name>
            <description>Port x reset bit y (y = 0..15)</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR0</name>
            <description>Port x reset bit y (y= 0..15)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP15</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP14</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP13</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP12</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP11</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP10</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP9</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP8</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP7</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP6</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP5</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP4</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP3</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP2</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP1</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOP0</name>
            <description>Port x set bit y (y= 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>LOCK</name>
        <displayName>LOCK</displayName>
        <description>GPIO port configuration lock register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LKK</name>
            <description>Port x lock bit y              </description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK15</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK14</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK13</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK12</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK11</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK10</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK9</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK8</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK7</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK6</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK5</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK4</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK3</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK2</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK1</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LK0</name>
            <description>Port x lock bit y (y= 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AFSEL0</name>
        <displayName>AFSEL0</displayName>
        <description>GPIO alternate function low register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SEL7</name>
            <description>Alternate function selection for port x bit y (y = 0..7)</description>
            <bitOffset>28</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL6</name>
            <description>Alternate function selection for port x bit y (y = 0..7)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL5</name>
            <description>Alternate function selection for port x bit y (y = 0..7)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL4</name>
            <description>Alternate function selection for port x bit y (y = 0..7)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL3</name>
            <description>Alternate function selection for port x bit y (y = 0..7)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL2</name>
            <description>Alternate function selection for port x bit y (y = 0..7)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL1</name>
            <description>Alternate function selection for port x bit y (y = 0..7)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL0</name>
            <description>Alternate function selection for port x bit y (y = 0..7)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AFSEL1</name>
        <displayName>AFSEL1</displayName>
        <description>GPIO alternate function register 1</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SEL15</name>
            <description>Alternate function selection for port x bit y (y = 8..15)</description>
            <bitOffset>28</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL14</name>
            <description>Alternate function selection for port x bit y (y = 8..15)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL13</name>
            <description>Alternate function selection for port x bit y (y = 8..15)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL12</name>
            <description>Alternate function selection for port x bit y (y = 8..15)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL11</name>
            <description>Alternate function selection for port x bit y (y = 8..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL10</name>
            <description>Alternate function selection for port x bit y (y = 8..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL9</name>
            <description>Alternate function selection for port x bit y (y = 8..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SEL8</name>
            <description>Alternate function selection for port x bit y (y = 8..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BC</name>
        <displayName>BC</displayName>
        <description>Port bit reset register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <access>write-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CR0</name>
            <description>Port cleat bit</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR1</name>
            <description>Port cleat bit</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR2</name>
            <description>Port cleat bit</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR3</name>
            <description>Port cleat bit</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR4</name>
            <description>Port cleat bit</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR5</name>
            <description>Port cleat bit</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR6</name>
            <description>Port cleat bit</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR7</name>
            <description>Port cleat bit</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR8</name>
            <description>Port cleat bit</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR9</name>
            <description>Port cleat bit</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR10</name>
            <description>Port cleat bit</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR11</name>
            <description>Port cleat bit</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR12</name>
            <description>Port cleat bit</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR13</name>
            <description>Port cleat bit</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR14</name>
            <description>Port cleat bit</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CR15</name>
            <description>Port cleat bit</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
