burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
      <register>
        <name>TG</name>
        <displayName>TG</displayName>
        <description>Port bit toggle register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <access>write-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TG0</name>
            <description>Port toggle bit </description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG1</name>
            <description>Port toggle bit</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG2</name>
            <description>Port toggle bit</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG3</name>
            <description>Port toggle bit</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG4</name>
            <description>Port toggle bit</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG5</name>
            <description>Port toggle bit</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG6</name>
            <description>Port toggle bit</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG7</name>
            <description>Port toggle bit</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG8</name>
            <description>Port toggle bit</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG9</name>
            <description>Port toggle bit</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG10</name>
            <description>Port toggle bit</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG11</name>
            <description>Port toggle bit</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG12</name>
            <description>Port toggle bit</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG13</name>
            <description>Port toggle bit</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG14</name>
            <description>Port toggle bit</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG15</name>
            <description>Port toggle bit</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
    </registers>
  </peripheral>
  <peripheral derivedFrom="GPIOB">
    <name>GPIOC</name>
    <baseAddress>0x48000800</baseAddress>
  </peripheral>
  <peripheral derivedFrom="GPIOB">
    <name>GPIOD</name>
    <baseAddress>0x48000C00</baseAddress>
  </peripheral>
  <peripheral derivedFrom="GPIOB">
    <name>GPIOF</name>
    <baseAddress>0x48001400</baseAddress>
  </peripheral>
  <peripheral>
    <name>NVIC</name>
    <description>Nested Vectored Interrupt Controller</description>
    <groupName>NVIC</groupName>
    <baseAddress>0xE000E100</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0xF00</size>
      <usage>registers</usage>
    </addressBlock>
    <addressBlock>
      <offset>0x33D</offset>
      <size>0xC3</size>
      <usage>reserved</usage>
    </addressBlock>
    <registers>
      <register>
        <name>ISER0</name>
        <displayName>ISER0</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER1</name>
        <displayName>ISER1</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER2</name>
        <displayName>ISER2</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER3</name>
        <displayName>ISER3</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER4</name>
        <displayName>ISER4</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER5</name>
        <displayName>ISER5</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER6</name>
        <displayName>ISER6</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER7</name>
        <displayName>ISER7</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER8</name>
        <displayName>ISER8</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER9</name>
        <displayName>ISER9</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER10</name>
        <displayName>ISER10</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER11</name>
        <displayName>ISER11</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER12</name>
        <displayName>ISER12</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER13</name>
        <displayName>ISER13</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER14</name>
        <displayName>ISER14</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER15</name>
        <displayName>ISER15</displayName>
        <description>Interrupt Set Enable Register</description>
        <addressOffset>0x3C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETENA</name>
            <description>SETENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER0</name>
        <displayName>ICER0</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER1</name>
        <displayName>ICER1</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER2</name>
        <displayName>ICER2</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0x8C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER3</name>
        <displayName>ICER3</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0x90</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER4</name>
        <displayName>ICER4</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER5</name>
        <displayName>ICER5</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0x98</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER6</name>
        <displayName>ICER6</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0x9C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER7</name>
        <displayName>ICER7</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0xA0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER8</name>
        <displayName>ICER8</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0xA4</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER9</name>
        <displayName>ICER9</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0xA8</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER10</name>
        <displayName>ICER10</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0xAC</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER11</name>
        <displayName>ICER11</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0xB0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER12</name>
        <displayName>ICER12</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0xB4</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER13</name>
        <displayName>ICER13</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0xB8</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER14</name>
        <displayName>ICER14</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0xBC</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICER15</name>
        <displayName>ICER15</displayName>
        <description>Interrupt Clear Enable register</description>
        <addressOffset>0xC0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>CLRENA</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR0</name>
        <displayName>ISPR0</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR1</name>
        <displayName>ISPR1</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR2</name>
        <displayName>ISPR2</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR3</name>
        <displayName>ISPR3</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x10C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
