burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
      <register>
        <name>ISPR4</name>
        <displayName>ISPR4</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR5</name>
        <displayName>ISPR5</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR6</name>
        <displayName>ISPR6</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR7</name>
        <displayName>ISPR7</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x11C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR8</name>
        <displayName>ISPR8</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x120</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR9</name>
        <displayName>ISPR9</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x124</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR10</name>
        <displayName>ISPR10</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x128</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR11</name>
        <displayName>ISPR11</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x12C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR12</name>
        <displayName>ISPR12</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR13</name>
        <displayName>ISPR13</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR14</name>
        <displayName>ISPR14</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISPR15</name>
        <displayName>ISPR15</displayName>
        <description>Interrupt Set-Pending Register</description>
        <addressOffset>0x13C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>SETPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR0</name>
        <displayName>ICPR0</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR1</name>
        <displayName>ICPR1</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR2</name>
        <displayName>ICPR2</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR3</name>
        <displayName>ICPR3</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x18C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR4</name>
        <displayName>ICPR4</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR5</name>
        <displayName>ICPR5</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR6</name>
        <displayName>ICPR6</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x198</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR7</name>
        <displayName>ICPR7</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x19C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR8</name>
        <displayName>ICPR8</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x1A0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR9</name>
        <displayName>ICPR9</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x1A4</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR10</name>
        <displayName>ICPR10</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x1A8</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR11</name>
        <displayName>ICPR11</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x1AC</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR12</name>
        <displayName>ICPR12</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x1B0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR13</name>
        <displayName>ICPR13</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x1B4</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR14</name>
        <displayName>ICPR14</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x1B8</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICPR15</name>
        <displayName>ICPR15</displayName>
        <description>Interrupt Clear-Pending register</description>
        <addressOffset>0x1BC</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>CLRPEND</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR0</name>
        <displayName>IABR0</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x200</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR1</name>
        <displayName>IABR1</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x204</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR2</name>
        <displayName>IABR2</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x208</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR3</name>
        <displayName>IABR3</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x20C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR4</name>
        <displayName>IABR4</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x210</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR5</name>
        <displayName>IABR5</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x214</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR6</name>
        <displayName>IABR6</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x218</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR7</name>
        <displayName>IABR7</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x21C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR8</name>
        <displayName>IABR8</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x220</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR9</name>
        <displayName>IABR9</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x224</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR10</name>
        <displayName>IABR10</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x228</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR11</name>
        <displayName>IABR11</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x22C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR12</name>
        <displayName>IABR12</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x230</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR13</name>
        <displayName>IABR13</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x234</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR14</name>
        <displayName>IABR14</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x238</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IABR15</name>
        <displayName>IABR15</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x23C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IABR</name>
            <description>IABR</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
