burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
      <register>
        <name>ITNS0</name>
        <displayName>ITNS0</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x280</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS1</name>
        <displayName>ITNS1</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x284</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS2</name>
        <displayName>ITNS2</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x288</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS3</name>
        <displayName>ITNS3</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x28C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS4</name>
        <displayName>ITNS4</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x290</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS5</name>
        <displayName>ITNS5</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x294</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS6</name>
        <displayName>ITNS6</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x298</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS7</name>
        <displayName>ITNS7</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x29C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS8</name>
        <displayName>ITNS8</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x2A0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS9</name>
        <displayName>ITNS9</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x2A4</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS10</name>
        <displayName>ITNS10</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x2A8</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS11</name>
        <displayName>ITNS11</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x2AC</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS12</name>
        <displayName>ITNS12</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x2B0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS13</name>
        <displayName>ITNS13</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x2B4</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS14</name>
        <displayName>ITNS14</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x2B8</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ITNS15</name>
        <displayName>ITNS15</displayName>
        <description>Interrupt Active bit register</description>
        <addressOffset>0x2BC</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ITNS</name>
            <description>ITNS</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR0</name>
        <displayName>IPR0</displayName>
        <description>Interrupt Priority Register 0</description>
        <addressOffset>0x300</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_00</name>
            <description>PRI_00</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR1</name>
        <displayName>IPR1</displayName>
        <description>Interrupt Priority Register 1</description>
        <addressOffset>0x301</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_01</name>
            <description>PRI_01</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR2</name>
        <displayName>IPR2</displayName>
        <description>Interrupt Priority Register 2</description>
        <addressOffset>0x302</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_02</name>
            <description>PRI_02</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR3</name>
        <displayName>IPR3</displayName>
        <description>Interrupt Priority Register 3</description>
        <addressOffset>0x303</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_03</name>
            <description>PRI_03</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR4</name>
        <displayName>IPR4</displayName>
        <description>Interrupt Priority Register 4</description>
        <addressOffset>0x304</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_04</name>
            <description>PRI_04</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR5</name>
        <displayName>IPR5</displayName>
        <description>Interrupt Priority Register 5</description>
        <addressOffset>0x305</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_05</name>
            <description>PRI_05</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR6</name>
        <displayName>IPR6</displayName>
        <description>Interrupt Priority Register 6</description>
        <addressOffset>0x306</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_06</name>
            <description>PRI_06</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR7</name>
        <displayName>IPR7</displayName>
        <description>Interrupt Priority Register 7</description>
        <addressOffset>0x307</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_07</name>
            <description>PRI_07</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR8</name>
        <displayName>IPR8</displayName>
        <description>Interrupt Priority Register 8</description>
        <addressOffset>0x308</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_08</name>
            <description>PRI_08</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR9</name>
        <displayName>IPR9</displayName>
        <description>Interrupt Priority Register 9</description>
        <addressOffset>0x309</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_09</name>
            <description>PRI_09</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR10</name>
        <displayName>IPR10</displayName>
        <description>Interrupt Priority Register 10</description>
        <addressOffset>0x30A</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_10</name>
            <description>PRI_10</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR11</name>
        <displayName>IPR11</displayName>
        <description>Interrupt Priority Register 11</description>
        <addressOffset>0x30B</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_11</name>
            <description>PRI_11</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR12</name>
        <displayName>IPR12</displayName>
        <description>Interrupt Priority Register 12</description>
        <addressOffset>0x30C</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_12</name>
            <description>PRI_12</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR13</name>
        <displayName>IPR13</displayName>
        <description>Interrupt Priority Register 13</description>
        <addressOffset>0x30D</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_13</name>
            <description>PRI_13</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR14</name>
        <displayName>IPR14</displayName>
        <description>Interrupt Priority Register 14</description>
        <addressOffset>0x30E</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_14</name>
            <description>PRI_14</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR15</name>
        <displayName>IPR15</displayName>
        <description>Interrupt Priority Register 15</description>
        <addressOffset>0x30F</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_15</name>
            <description>PRI_15</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR16</name>
        <displayName>IPR16</displayName>
        <description>Interrupt Priority Register 16</description>
        <addressOffset>0x310</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_16</name>
            <description>PRI_16</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR17</name>
        <displayName>IPR17</displayName>
        <description>Interrupt Priority Register 17</description>
        <addressOffset>0x311</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_17</name>
            <description>PRI_17</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR18</name>
        <displayName>IPR18</displayName>
        <description>Interrupt Priority Register 18</description>
        <addressOffset>0x312</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_18</name>
            <description>PRI_18</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR19</name>
        <displayName>IPR19</displayName>
        <description>Interrupt Priority Register 19</description>
        <addressOffset>0x313</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_19</name>
            <description>PRI_19</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR20</name>
        <displayName>IPR20</displayName>
        <description>Interrupt Priority Register 20</description>
        <addressOffset>0x314</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_20</name>
            <description>PRI_20</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR21</name>
        <displayName>IPR21</displayName>
        <description>Interrupt Priority Register 21</description>
        <addressOffset>0x315</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_21</name>
            <description>PRI_21</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR22</name>
        <displayName>IPR22</displayName>
        <description>Interrupt Priority Register 22</description>
        <addressOffset>0x316</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_22</name>
            <description>PRI_22</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR23</name>
        <displayName>IPR23</displayName>
        <description>Interrupt Priority Register 23</description>
        <addressOffset>0x317</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_23</name>
            <description>PRI_23</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR24</name>
        <displayName>IPR24</displayName>
        <description>Interrupt Priority Register 24</description>
        <addressOffset>0x318</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_24</name>
            <description>PRI_24</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR25</name>
        <displayName>IPR25</displayName>
        <description>Interrupt Priority Register 25</description>
        <addressOffset>0x319</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_25</name>
            <description>PRI_25</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR26</name>
        <displayName>IPR26</displayName>
        <description>Interrupt Priority Register 26</description>
        <addressOffset>0x31A</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_26</name>
            <description>PRI_26</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR27</name>
        <displayName>IPR27</displayName>
        <description>Interrupt Priority Register 27</description>
        <addressOffset>0x31B</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_27</name>
            <description>PRI_27</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
