burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
      <register>
        <name>IPR28</name>
        <displayName>IPR28</displayName>
        <description>Interrupt Priority Register 28</description>
        <addressOffset>0x31C</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_28</name>
            <description>PRI_28</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR29</name>
        <displayName>IPR29</displayName>
        <description>Interrupt Priority Register 29</description>
        <addressOffset>0x31D</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_29</name>
            <description>PRI_29</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR30</name>
        <displayName>IPR30</displayName>
        <description>Interrupt Priority Register 30</description>
        <addressOffset>0x31E</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_30</name>
            <description>PRI_30</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IPR31</name>
        <displayName>IPR31</displayName>
        <description>Interrupt Priority Register 31</description>
        <addressOffset>0x31F</addressOffset>
        <size>0x08</size>
        <access>read-write</access>
        <resetValue>0x00</resetValue>
        <fields>
          <field>
            <name>PRI_31</name>
            <description>PRI_31</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
    </registers>
  </peripheral>
  <peripheral>
    <name>PMU</name>
    <description>Power management unit</description>
    <groupName>PMU</groupName>
    <baseAddress>0x40007000</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <registers>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>Control register 0</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00029000</resetValue>
        <fields>
          <field>
            <name>LPLDOEN</name>
            <description>Low power LDO enable</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DSMODVS</name>
            <description>Deep-sleep mode voltage selection.</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BKPWEN</name>
            <description>Backup Domain (VCORE_STB) Write Enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STBRST</name>
            <description>Standby Flag Reset</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WURST</name>
            <description>Wakeup Flag Reset</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LPMOD</name>
            <description>Select the low-power mode to enter when the Cortex-M23 enters SLEEPDEEP mode.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CS</name>
        <displayName>CS</displayName>
        <description>Control and status register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>NPRDY</name>
            <description>NPLDO ready flag</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LDOVSRF</name>
            <description>LDO voltage select ready flag.</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>WUPEN5</name>
            <description>WKUP Pin5 (PB5) Enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WUPEN3</name>
            <description>WKUP Pin3 (PA2) enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WUPEN2</name>
            <description>WKUP Pin2 (PB6) enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WUPEN1</name>
            <description>WKUP Pin1(PC13 / PA4) enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WUPEN0</name>
            <description>WKUP Pin0(PA0) enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STBF</name>
            <description>Standby Flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>WUF</name>
            <description>Wakeup Flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>Control register 1</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>EFDSPSLEEP</name>
            <description>EFLASH power off contrl when MCU enters to Deep-sleep/Deep-sleep1 mode.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EFPSLEEP</name>
            <description>EFLASH power off control when MCU enters to Run/Run1 mode.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Status register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00C00020</resetValue>
        <fields>
          <field>
            <name>EFLASHPS_ACTIVE</name>
            <description>EFLASH is in active state.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EFLASHPS_SLEEP</name>
            <description>EFLASH is in sleep state.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PAR</name>
        <displayName>PAR</displayName>
        <description>Parameter register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x0C0A0000</resetValue>
        <fields>
          <field>
            <name>TWK_EFLASH</name>
            <description>EFLASH wake up from Deep-sleep/Deep-sleep1 mode counter.</description>
            <bitOffset>21</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSW_IRC48MCNT</name>
            <description>When enter Deep-sleep/Deep-sleep1 mode, switch to IRC48M clock.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
