burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral>
    <name>RCU</name>
    <description>Reset and clock unit</description>
    <groupName>RCU</groupName>
    <baseAddress>0x40021000</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>RCU_CTC</name>
      <value>4</value>
    </interrupt>

    <registers>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>Control register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x44000043</resetValue>
        <fields>
          <field>
            <name>IRC48MDIV_SYS</name>
            <description>IRC48M clock divider factor for system clock</description>
            <bitOffset>29</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IRC48M_PEREN</name>
            <description>IRC48M always-enable for peripheral.</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IRC48MDIV_PER</name>
            <description>IRC48M clock divider factor for peripheral clock</description>
            <bitOffset>25</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CKMEN</name>
            <description>HXTAL clock monitor enable</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HXTALBPS</name>
            <description>External crystal oscillator (HXTAL) clock bypass mode enable</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HXTALSTB</name>
            <description>External crystal oscillator (HXTAL) clock stabilization flag</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HXTALEN</name>
            <description>External high speed oscillator enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IRC48MCALIB</name>
            <description>Internal 48M RC oscillator calibration value register</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRC48MADJ</name>
            <description>Internal 48M RC oscillator clock trim adjust value</description>
            <bitOffset>2</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IRC48MSTB</name>
            <description>IRC48M high speed internal oscillator stabilization flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRC48MEN</name>
            <description>Internal high speed oscillator enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CFG0</name>
        <displayName>CFG0</displayName>
        <description>Configuration register 0</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CKOUT0DIV</name>
            <description>The CK_OUT0 divider which the CK_OUT0 frequency can be reduced,</description>
            <bitOffset>28</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CKOUT0SEL</name>
            <description>CK_OUT0 clock source selection</description>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CKOUT1DIV</name>
            <description>The CK_OUT1 divider which the CK_OUT1 frequency can be reduced,</description>
            <bitOffset>20</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CKOUT1SEL</name>
            <description>CK_OUT1 clock source selection</description>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>APBPSC</name>
            <description>APB prescaler selection</description>
            <bitOffset>11</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>AHBPSC</name>
            <description>AHB prescaler selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCSS</name>
            <description>System clock switch status</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SCS</name>
            <description>System clock switch</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INT</name>
        <displayName>INT</displayName>
        <description>Interrupt register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CKMIC</name>
            <description>HXTAL clock stuck interrupt clear</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>LCKMIC</name>
            <description>LXTAL clock stuck interrupt clear</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>HXTALSTBIC</name>
            <description>HXTAL stabilization interrupt clear</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>IRC48MSTBIC</name>
            <description>IRC48M stabilization interrupt clear</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>LXTALSTBIC</name>
            <description>LXTAL stabilization interrupt clear</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>IRC32KSTBIC</name>
            <description>IRC32K stabilization interrupt clear</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>HXTALSTBIE</name>
            <description>HXTAL stabilization interrupt enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IRC48MSTBIE</name>
            <description>IRC48M stabilization interrupt enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LXTALSTBIE</name>
            <description>LXTAL stabilization interrupt enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IRC32KSTBIE</name>
            <description>IRC32K stabilization interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CKMIF</name>
            <description>HXTAL clock stuck interrupt flag</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LCKMIF</name>
            <description>LXTAL clock stuck interrupt flag</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HXTALSTBIF</name>
            <description>HXTAL stabilization interrupt flag</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRC48MSTBIF</name>
            <description>IRC48M stabilization interrupt flag</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LXTALSTBIF</name>
            <description>LXTAL stabilization interrupt flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRC32KSTBIF</name>
            <description>IRC32K stabilization interrupt flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>AHB1RST</name>
        <displayName>AHB1RST</displayName>
        <description>AHB1 reset register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DMAMUXRST</name>
            <description>DMAMUX reset</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DMARST</name>
            <description>DMA reset</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CRCRST</name>
            <description>CRC Reset</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>AHB2RST</name>
        <displayName>AHB2RST</displayName>
        <description>AHB2 reset register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PFRST</name>
            <description>GPIO port F reset</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDRST</name>
            <description>GPIO port D reset</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PCRST</name>
            <description>GPIO port C reset</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PBRST</name>
            <description>GPIO port B reset</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PARST</name>
            <description>GPIO port A reset</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>APBRST</name>
        <displayName>APBRST</displayName>
        <description>APB reset register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PMURST</name>
            <description>PMU reset</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C1RST</name>
            <description>I2C1 reset</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C0RST</name>
            <description>I2C0 reset</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USART2RST</name>
            <description>USART2 Reset</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER16RST</name>
            <description>TIMER16 reset</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER15RST</name>
            <description>TIMER15 reset</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER13RST</name>
            <description>TIMER13 reset</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USART1RST</name>
            <description>USART1 Reset</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USART0RST</name>
            <description>USART0 Reset</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPI1RST</name>
            <description>SPI1 Reset</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPI0RST</name>
            <description>SPI0 Reset</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER2RST</name>
            <description>TIMER2 reset</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER0RST</name>
            <description>TIMER0 reset</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ADCRST</name>
            <description>ADC reset</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WWDGTRST</name>
            <description>WWDGT reset</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMPRST</name>
            <description>Comparator reset</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SYSCFGRST</name>
            <description>System configuration reset</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>AHB1EN</name>
        <displayName>AHB1EN</displayName>
        <description>AHB1 enable register</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000010</resetValue>
        <fields>
          <field>
            <name>DMAMUXEN</name>
            <description>DMAMUX clock enable</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DMAEN</name>
            <description>DMA clock enable</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CRCEN</name>
            <description>CRC clock enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FMCEN</name>
            <description>FMC clock enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>AHB2EN</name>
        <displayName>AHB2EN</displayName>
        <description>AHB2 enable register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PFEN</name>
            <description>GPIO port F clock enable</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDEN</name>
            <description>GPIO port D clock enable</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PCEN</name>
            <description>GPIO port C clock enable</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PBEN</name>
            <description>GPIO port B clock enable</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PAEN</name>
            <description>GPIO port A clock enable</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
