burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
      <register>
        <name>APBEN</name>
        <displayName>APBEN</displayName>
        <description>APB enable register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PMUEN</name>
            <description>PMU clock enable</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DBGEN</name>
            <description>DBG clock enable</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C1EN</name>
            <description>I2C1 clock enable</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C0EN</name>
            <description>I2C0 clock enable</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USART2EN</name>
            <description>USART2 clock enable</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER16EN</name>
            <description>TIMER16 timer clock enable</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER15EN</name>
            <description>TIMER15 timer clock enable</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER13EN</name>
            <description>TIMER13 timer clock enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USART1EN</name>
            <description>USART1 clock enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USART0EN</name>
            <description>USART0 clock enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPI1EN</name>
            <description>SPI1 clock enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPI0EN</name>
            <description>SPI0 clock enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER2EN</name>
            <description>TIMER2 timer clock enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER0EN</name>
            <description>TIMER0 timer clock enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ADCEN</name>
            <description>ADC interface clock enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WWDGTEN</name>
            <description>WWDGT clock enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMPEN</name>
            <description>Comparator clock enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SYSCFGEN</name>
            <description>System configuration clock enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>AHB1SPDPEN</name>
        <displayName>AHB1SPDPEN</displayName>
        <description>AHB1 sleep and deep sleep mode enable register</description>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <resetValue>0x00A01014</resetValue>
        <fields>
          <field>
            <name>DMAMUXSPDPEN</name>
            <description>DMAMUX clock enable when sleep and deep sleep mode</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DMASPDPEN</name>
            <description>DMA clock enable when sleep and deep sleep mode</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CRCSPDPEN</name>
            <description>CRC clock enable when sleep and deep sleep mode</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FMCSPDPEN</name>
            <description>FMC clock enable when sleep and deep sleep mode</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SRAMSPDPEN</name>
            <description>SRAM interface clock enable when sleep and deep sleep mode</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>AHB2SPDPEN</name>
        <displayName>AHB2SPDPEN</displayName>
        <description>AHB2 sleep and deep sleep mode enable register</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <resetValue>0x005E0000</resetValue>
        <fields>
          <field>
            <name>PFSPDPEN</name>
            <description>GPIO port F clock enable when sleep and deep sleep mode</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDSPDPEN</name>
            <description>GPIO port D clock enable when sleep and deep sleep mode</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PCSPDPEN</name>
            <description>GPIO port C clock enable when sleep and deep sleep mode</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PBSPDPEN</name>
            <description>GPIO port B clock enable when sleep and deep sleep mode</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PASPDPEN</name>
            <description>GPIO port A clock enable when sleep and deep sleep mode</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>APBSPDPEN</name>
        <displayName>APBSPDPEN</displayName>
        <description>APB sleep and deep sleep mode enable register</description>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
        <resetValue>0x106FFF03</resetValue>
        <fields>
          <field>
            <name>PMUSPDPEN</name>
            <description>PMU clock enable when sleep and deep sleep mode</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C1SPDPEN</name>
            <description>I2C1 clock enable when sleep mode and deep sleep mode</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C0SPDPEN</name>
            <description>I2C0 clock enable when sleep mode and deep sleep mode</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USART2SPDPEN</name>
            <description>USART2 clock enable when sleep mode and deep sleep mode</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER16SPDPEN</name>
            <description>TIMER16 clock enable when sleep and deep sleep mode</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER15SPDPEN</name>
            <description>TIMER15 clock enable when sleep and deep sleep mode</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER13SPDPEN</name>
            <description>TIMER13 clock enable when sleep and deep sleep mode</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USART1SPDPEN</name>
            <description>USART1 clock enable when sleep and deep sleep mode</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USART0SPDPEN</name>
            <description>USART0 clock enable when sleep and deep sleep mode</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPI1SPDPEN</name>
            <description>SPI1 clock enable when sleep and deep sleep mode</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPI0SPDPEN</name>
            <description>SPI0 clock enable when sleep and deep sleep mode</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER2SPDPEN</name>
            <description>TIMER2 clock enable when sleep and deep sleep mode</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMER0SPDPEN</name>
            <description>TIMER0 clock enable when sleep and deep sleep mode</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ADCSPDPEN</name>
            <description>ADC clock enable when sleep and deep sleep mode</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WWDGTSPDPEN</name>
            <description>WWDGT clock enable when sleep and deep sleep mode</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMPSPDPEN</name>
            <description>CMP clock enable when sleep and deep sleep mode</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SYSCFGSPDPEN</name>
            <description>System configuration clock enable when sleep and deep sleep mode</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>Control register 1</description>
        <addressOffset>0x70</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000008</resetValue>
        <fields>
          <field>
            <name>LSCKOUTSEL</name>
            <description>Low speed clock output selection</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LSCKOUTEN</name>
            <description>Low speed clock output enable</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BKPRST</name>
            <description>Backup domain reset</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RTCEN</name>
            <description>RTC clock enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RTCSRC</name>
            <description>RTC clock entry selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LXTALSTBRST</name>
            <description>LXTAL stabilization reset.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LCKMD</name>
            <description>LXTAL clock failure detection</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LCKMEN</name>
            <description>LXTAL clock monitor enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LXTALDRI</name>
            <description>LXTAL drive capability</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LXTALBPS</name>
            <description>LXTAL bypass mode enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LXTALSTB</name>
            <description>External low-speed oscillator stabilization</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LXTALEN</name>
            <description>LXTAL enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>RSTSCK</name>
        <displayName>RSTSCK</displayName>
        <description>Reset source /clock register</description>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LPRSTF</name>
            <description>Low-power reset flag</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>WWDGTRSTF</name>
            <description>Window watchdog timer reset flag</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FWDGTRSTF</name>
            <description>Free Watchdog timer reset flag</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SWRSTF</name>
            <description>Software reset flag</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PORRSTF</name>
            <description>Power reset flag</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EPRSTF</name>
            <description>External PIN reset flag</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BORRSTF</name>
            <description>BOR reset flag</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RSTFC</name>
            <description>Reset flag clear</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OBLRSTF</name>
            <description>Option byte loader reset flag</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRC32KSTB</name>
            <description>IRC32K stabilization</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRC32KEN</name>
            <description>IRC32K enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CFG1</name>
        <displayName>CFG1</displayName>
        <description>Configuration register 1</description>
        <addressOffset>0x8C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>I2SSEL</name>
            <description>I2S clock source selection</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ADCPSC</name>
            <description>ADC clock prescaler selection</description>
            <bitOffset>9</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ADCSEL</name>
            <description>CK_ADC clock source selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C1SEL</name>
            <description>CK_I2C1 clock source selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C0SEL</name>
            <description>CK_I2C0 clock source selection</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USART0SEL</name>
            <description>CK_USART0 clock source selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
