burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral>
    <name>WWDGT</name>
    <description>Window watchdog timer</description>
    <groupName>WWDGT</groupName>
    <baseAddress>0x40002C00</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>WWDGT</name>
      <value>0</value>
    </interrupt>
    <registers>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000007F</resetValue>
        <fields>
          <field>
            <name>WDGTEN</name>
            <description>Activation bit</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CNT</name>
            <description>7-bit counter</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>Configuration register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000007F</resetValue>
        <fields>
          <field>
            <name>PSC_2_3</name>
            <description>Prescaler</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EWIE</name>
            <description>Early wakeup interrupt</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PSC_0_1</name>
            <description>Prescaler</description>
            <bitOffset>7</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>WIN</name>
            <description>7-bit window value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Status register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>EWIF</name>
            <description>Early wakeup interrupt flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
    </registers>
  </peripheral>
  <peripheral>
    <name>CMP</name>
    <description>Comparator</description>
    <groupName>CMP</groupName>
    <baseAddress>0x40017C00</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>CMP0</name>
      <value>34</value>
    </interrupt>
    <interrupt>
      <name>CMP1</name>
      <value>35</value>
    </interrupt>
    <registers>
      <register>
        <name>CMP0_CS</name>
        <displayName>CMP0_CS</displayName>
        <description>CMP0 Control / Status register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CMP0LK</name>
            <description>CMP0 lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP0O</name>
            <description>CMP0 output state</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>CMP0SEN</name>
            <description>Voltage scaler enable bit</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP0BEN</name>
            <description>Scaler bridge enable bit</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP0BLK</name>
            <description>CMP0 output blanking source</description>
            <bitOffset>18</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP0HST</name>
            <description>CMP0 hysteresis</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP0PL</name>
            <description>Polarity of CMP0 output</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP0SW</name>
            <description>CMP0 switch</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP0MSEL</name>
            <description>CMP0_IM input selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP0M</name>
            <description>CMP0 mode</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP0EN</name>
            <description>CMP0 enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CMP1_CS</name>
        <displayName>CMP1_CS</displayName>
        <description>CMP1 Control / Status register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CMP1LK</name>
            <description>CMP1 lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP1O</name>
            <description>CMP1 output state</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>CMP1SEN</name>
            <description>Voltage scaler enable bit</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP1BEN</name>
            <description>Scaler bridge enable bit</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP1BLK</name>
            <description>CMP1 output blanking source</description>
            <bitOffset>18</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP1HST</name>
            <description>CMP1 hysteresis</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP1PL</name>
            <description>Polarity of CMP1 output</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP1SW</name>
            <description>CMP1 switch</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP1MSEL</name>
            <description>CMP1_IM input selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP1M</name>
            <description>CMP1 mode</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMP1EN</name>
            <description>CMP1 enable.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
