burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral>
    <name>I2C0</name>
    <description>Inter integrated circuit</description>
    <groupName>I2C</groupName>
    <baseAddress>0x40005400</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>I2C0_EV</name>
      <value>17</value>
    </interrupt>
    <interrupt>
      <name>I2C0_ER</name>
      <value>18</value>
    </interrupt>
    <interrupt>
      <name>I2C0_WAKE</name>
      <value>36</value>
    </interrupt>
    <registers>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>Control register 0</description>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PECEN</name>
            <description>PEC Calculation Switch</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBALTEN</name>
            <description>SMBus Alert enable</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBDAEN</name>
            <description>SMBus device default address enable</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBHAEN</name>
            <description>SMBus Host address enable</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GCEN</name>
            <description>Whether or not to response to a General Call</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WUEN</name>
            <description>Wakeup from Deep-sleep mode enable</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SS</name>
            <description>Whether to stretch SCL low when data is not ready in slave mode</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SBCTL</name>
            <description>Slave byte control</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DENR</name>
            <description>DMA enable for reception</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DENT</name>
            <description>DMA enable for transmission</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ANOFF</name>
            <description>Analog noise filter disable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DNF</name>
            <description>Digital noise filter</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ERRIE</name>
            <description>Error interrupt enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCIE</name>
            <description>Transfer complete interrupt enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STPDETIE</name>
            <description>Stop detection interrupt enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NACKIE</name>
            <description>Not acknowledge received interrupt enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDMIE</name>
            <description>Address match interrupt enable in slave mode</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RBNEIE</name>
            <description>Receive interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIE</name>
            <description>Receive interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2CEN</name>
            <description>I2C peripheral enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>Control register 1</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PECTRANS</name>
            <description>PEC Transfer</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AUTOEND</name>
            <description>Automatic end mode in master mode</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RELOAD</name>
            <description>Reload mode</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BYTENUM</name>
            <description>Number of bytes to be transferred</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>NACKEN</name>
            <description>Generate NACK in slave mode</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STOP</name>
            <description>Generate a STOP condition on I2C bus</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>START</name>
            <description>Generate a START condition on I2C bus</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HEAD10R</name>
            <description>10-bit address header executes read direction only in master receive mode</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADD10EN</name>
            <description>10-bit addressing mode enable in master mode</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRDIR</name>
            <description>Transfer direction in master mode</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SADDRESS</name>
            <description>Slave address to be sent</description>
            <bitOffset>0</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SADDR0</name>
        <displayName>SADDR0</displayName>
        <description>Slave address register 0</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ADDRESSEN</name>
            <description>I2C address enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDFORMAT</name>
            <description>Address mode for the I2C slave</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDRESS_8_9</name>
            <description>7-bit address or bits 7:1 of a 10-bit address</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>ADDRESS_1_7</name>
            <description>Highest two bits of a 10-bit address</description>
            <bitOffset>1</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>ADDRESS_0</name>
            <description>Bit 0 of a 10-bit address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SADDR1</name>
        <displayName>SADDR1</displayName>
        <description>Slave address register 1</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>ADDRESS2EN</name>
            <description>Second I2C address enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDMSK2</name>
            <description>ADDRESS2[7:1] mask</description>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>ADDRESS2</name>
            <description>Second I2C address for the slave</description>
            <bitOffset>1</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMING</name>
        <displayName>TIMING</displayName>
        <description>Timing register </description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PSC</name>
            <description>Timing prescaler</description>
            <bitOffset>28</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SCLDELY</name>
            <description>Data setup time</description>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SDADELY</name>
            <description>Data hold time</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SCLH</name>
            <description>SCL high period</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>SCLL</name>
            <description>SCL low period</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMEOUT</name>
        <displayName>TIMEOUT</displayName>
        <description>timeout register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>EXTOEN</name>
            <description>Extended clock timeout detection enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BUSTOB</name>
            <description>Bus timeout B</description>
            <bitOffset>16</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TOEN</name>
            <description>Clock timeout detection enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TOIDLE</name>
            <description>Idle clock timeout detection</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BUSTOA</name>
            <description>Bus timeout A</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Transfer status register </description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x00000001</resetValue>
        <fields>
          <field>
            <name>READDR</name>
            <description>Received match address in slave mode</description>
            <bitOffset>17</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>TR</name>
            <description>Whether the I2C is a transmitter or a receiver in slave mode</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2CBSY</name>
            <description>Busy flag</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBALT</name>
            <description>SMBus Alert</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIMEOUT</name>
            <description>TIMEOUT flag</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PECERR</name>
            <description>PEC error</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OUERR</name>
            <description>Overrun/Underrun error in slave mode</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LOSTARB</name>
            <description>Arbitration Lost</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BERR</name>
            <description>Bus error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCR</name>
            <description>Transfer complete reload</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TC</name>
            <description>Transfer complete in master mode</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STPDET</name>
            <description>STOP condition is detected on the bus</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NACK</name>
            <description>Not Acknowledge flag</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDSEND</name>
            <description>Address received matches in slave mode</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RBNE</name>
            <description>I2C_RDATA is not empty during receiving</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TI</name>
            <description>Transmit interrupt</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TBE</name>
            <description>I2C_TDATA is empty during transmitting</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>STATC</name>
        <displayName>STATC</displayName>
        <description>Status clear register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <access>write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SMBALTC</name>
            <description>SMBus Alert flag clear</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIMEOUTC</name>
            <description>TIMEOUT flag clear</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PECERRC</name>
            <description>PEC error flag clear</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OUERRC</name>
            <description>Overrun/Underrun flag clear</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LOSTARBC</name>
            <description>Arbitration Lost flag clear</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BERRC</name>
            <description>Bus error flag clear</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STPDETC</name>
            <description>STPDET flag clear</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NACKC</name>
            <description>Not Acknowledge flag clear</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDSENDC</name>
            <description>ADDSEND flag clear</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PEC</name>
        <displayName>PEC</displayName>
        <description>Packet Error Check register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <access>read</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PECV</name>
            <description>Packet Error Checking Value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RDATA</name>
        <displayName>RDATA</displayName>
        <description>receive data register </description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <access>read</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>RDATA</name>
            <description>Receive data value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TDATA</name>
        <displayName>TDATA</displayName>
        <description>Transmit data register </description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TDATA</name>
            <description>Transmit data value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL2</name>
        <displayName>CTL2</displayName>
        <description>Control register 2</description>
        <addressOffset>0x90</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000FE00</resetValue>
        <fields>
          <field>
            <name>ADDM</name>
            <description>Defines which bits of ADDRESS are compared with an incoming address byte</description>
            <bitOffset>9</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        </fields>
      </register>
