burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral derivedFrom="I2C0">
    <name>I2C1</name>
    <baseAddress>0x40005800</baseAddress>
    <interrupt>
      <name>I2C1_EV</name>
      <value>19</value>
    </interrupt>
    <interrupt>
      <name>I2C1_ER</name>
      <value>20</value>
    </interrupt>
    <interrupt>
      <name>I2C1_WAKE</name>
      <value>37</value>
    </interrupt>
  </peripheral>
  <peripheral>
    <name>RTC</name>
    <description>Real time clock</description>
    <groupName>RTC</groupName>
    <baseAddress>0x40002800</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>RTC_Tamper_Timestamp</name>
      <value>1</value>
    </interrupt>
    <interrupt>
      <name>RTC_WAKE</name>
      <value>2</value>
    </interrupt>
    <interrupt>
      <name>RTC_Alarm</name>
      <value>23</value>
    </interrupt>
    <registers>
      <register>
        <name>TIME</name>
        <displayName>TIME</displayName>
        <description>Time register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PM</name>
            <description>AM/PM mark</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HRT</name>
            <description>Hour tens in BCD code</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HRU</name>
            <description>Hour units in BCD code</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MNT</name>
            <description>Minute tens in BCD code</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MNU</name>
            <description>Minute units in BCD code</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCT</name>
            <description>Second tens in BCD code</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCU</name>
            <description>Second units in BCD code</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DATE</name>
        <displayName>DATE</displayName>
        <description>Date register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00002101</resetValue>
        <fields>
          <field>
            <name>YRT</name>
            <description>Year tens in BCD code</description>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>YRU</name>
            <description>Year units in BCD code</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DOW</name>
            <description>Days of the week</description>
            <bitOffset>13</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MONT</name>
            <description>Month tens in BCD code</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MONU</name>
            <description>Month units in BCD code</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DAYT</name>
            <description>Day tens in BCD code</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DAYU</name>
            <description>Day units in BCD code</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>OUT2EN</name>
            <description>RTC_OUT2 pin enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>COEN</name>
            <description>Calibration output enable</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OS</name>
            <description>Output selection</description>
            <bitOffset>21</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OPOL</name>
            <description>Output polarity</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>COS</name>
            <description>Calibration output selection</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DSM</name>
            <description>Daylight saving mark</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>S1H</name>
            <description>Subtract 1 hour(winter time change)</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>A1H</name>
            <description>Add 1 hour(summer time change)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>TSIE</name>
            <description>Time-stamp interrupt enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ALRM0IE</name>
            <description>RTC alarm-0 interrupt enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSEN</name>
            <description>Time-stamp function enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ALRM0EN</name>
            <description>Alarm-0 function enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CS</name>
            <description>Clock System</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BPSHAD</name>
            <description>Shadow registers bypass control</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>REFEN</name>
            <description>Reference clock detection function enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSEG</name>
            <description>Valid event edge of time-stamp</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Status register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000007</resetValue>
        <fields>
          <field>
            <name>SCPF</name>
            <description>Smooth calibration pending flag</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TSOVRF</name>
            <description>Time-stamp overflow flag</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSF</name>
            <description>Time-stamp flag</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ALRM0F</name>
            <description>Alarm-0 occurs flag</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INITM</name>
            <description>Enter initialization mode</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INITF</name>
            <description>Initialization state flag</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RSYNF</name>
            <description>Register synchronization flag</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>YCM</name>
            <description>Year configuration mark</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SOPF</name>
            <description>Shift function operation pending flag</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ALRM0WF</name>
            <description>Alarm 0 configuration can be write flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PSC</name>
        <displayName>PSC</displayName>
        <description>Prescaler register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x007F00FF</resetValue>
        <fields>
          <field>
            <name>FACTOR_A</name>
            <description>Asynchronous prescaler factor</description>
            <bitOffset>16</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FACTOR_S</name>
            <description>Synchronous prescaler factor</description>
            <bitOffset>0</bitOffset>
            <bitWidth>15</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ALRM0TD</name>
        <displayName>ALRM0TD</displayName>
        <description>Alarm 0 time and date register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>MSKD</name>
            <description>Alarm date mask bit</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DOWS</name>
            <description>Day of the week selected</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DAYT</name>
            <description>Date tens in BCD code</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DAYU</name>
            <description>Date units or week day in BCD code</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MSKH</name>
            <description>Alarm hour mask bit</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PM</name>
            <description>AM/PM flag</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HRT</name>
            <description>Hour tens in BCD code</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HRU</name>
            <description>Hour units in BCD code</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MSKM</name>
            <description>Alarm minutes mask bit</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MNT</name>
            <description>Minutes tens in BCD code</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MNU</name>
            <description>Minutes units in BCD code</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MSKS</name>
            <description>Alarm second mask bit</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCT</name>
            <description>Second tens in BCD code</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCU</name>
            <description>Second units in BCD code</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>WPK</name>
        <displayName>WPK</displayName>
        <description>Write protection key register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>WPK</name>
            <description>Key for write protection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SS</name>
        <displayName>SS</displayName>
        <description>Sub second register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SSC</name>
            <description>Sub second value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SHIFTCTL</name>
        <displayName>SHIFTCTL</displayName>
        <description>Shift function control register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>A1S</name>
            <description>One second add</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>SFS</name>
            <description>Subtract a fraction of a second</description>
            <bitOffset>0</bitOffset>
            <bitWidth>15</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TTS</name>
        <displayName>TTS</displayName>
        <description>Time of time stamp register</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PM</name>
            <description>AM/PM mark</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HRT</name>
            <description>Hour tens in BCD code</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HRU</name>
            <description>Hour units in BCD code</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>MNT</name>
            <description>Minute tens in BCD code</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>MNU</name>
            <description>Minute units in BCD code</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SCT</name>
            <description>Second tens in BCD code</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SCU</name>
            <description>Second units in BCD code</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DTS</name>
        <displayName>DTS</displayName>
        <description>Date of time stamp register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DOW</name>
            <description>Days of the week</description>
            <bitOffset>13</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>MONT</name>
            <description>Month tens in BCD code</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>MONU</name>
            <description>Month units in BCD code</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DAYT</name>
            <description>Day tens in BCD code</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DAYU</name>
            <description>Day units in BCD code</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSTS</name>
        <displayName>SSTS</displayName>
        <description>Sub second of time stamp register</description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SSC</name>
            <description>Sub second value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>HRFC</name>
        <displayName>HRFC</displayName>
        <description>High resolution frequency compensation register</description>
        <addressOffset>0x3C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>FREQI</name>
            <description>Increase RTC frequency by 488.5PPM</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CWND8</name>
            <description>Frequency compensation window 8 second selected</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CWND16</name>
            <description>Frequency compensation window 16 second selected</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CMSK</name>
            <description>Calibration mask number</description>
            <bitOffset>0</bitOffset>
            <bitWidth>9</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
