burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
      <register>
        <name>TYPE</name>
        <displayName>TYPE</displayName>
        <description>Type register</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ALRMOUTTYPE</name>
            <description>RTC_ALARM Output Type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DISPU</name>
            <description>RTC_TAMP pin pull up disable bit</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ALRM0SS</name>
        <displayName>ALRM0SS</displayName>
        <description>Alarm 0 sub second register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>MSKSSC</name>
            <description>Mask control bit of SSC</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SSC</name>
            <description>Alarm sub second value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>15</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>BKP0</name>
        <displayName>BKP0</displayName>
        <description>Backup registers</description>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DATA</name>
            <description>Data</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>BKP1</name>
        <displayName>BKP1</displayName>
        <description>Backup registers</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DATA</name>
            <description>Data</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>BKP2</name>
        <displayName>BKP2</displayName>
        <description>Backup registers</description>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DATA</name>
            <description>Data</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>BKP3</name>
        <displayName>BKP3</displayName>
        <description>Backup registers</description>
        <addressOffset>0x5C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DATA</name>
            <description>Data</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
    </registers>
  </peripheral>
  <peripheral>
    <name>SPI1</name>
    <description>Serial peripheral interface</description>
    <groupName>SPI</groupName>
    <baseAddress>0x40003800</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>SPI1</name>
      <value>22</value>
    </interrupt>
    <registers>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>control register 0</description>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>BDEN</name>
            <description>Bidirectional enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BDOEN</name>
            <description>Bidirectional Transmit output enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCEN</name>
            <description>Hardware CRC calculation enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCNT</name>
            <description>CRC transfer next</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCL</name>
            <description>CRC length</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RO</name>
            <description>Receive only</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWNSSEN</name>
            <description>NSS Software Mode Selection</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWNSS</name>
            <description>NSS Pin Selection In NSS Software Mode</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LF</name>
            <description>LSB First Mode</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPIEN</name>
            <description>SPI enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PSC</name>
            <description>Master Clock Prescaler Selection</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>MSTMOD</name>
            <description>Master Mode Enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKPL</name>
            <description>Clock Polarity Selection</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKPH</name>
            <description>Clock Phase Selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>control register 1</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000700</resetValue>
        <fields>
          <field>
            <name>TXDMA_ODD</name>
            <description>Odd bytes in TX DMA channel</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXDMA_ODD</name>
            <description>Odd bytes in RX DMA channel</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BYTEN</name>
            <description>Byte access enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DZ</name>
            <description>Date size</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>TBEIE</name>
            <description>Transmit Buffer Empty Interrupt Enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RBNEIE</name>
            <description>Receive Buffer Not Empty Interrupt Enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIE</name>
            <description>Error interrupt enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMOD</name>
            <description>SPI TI Mode Enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NSSP</name>
            <description>SPI NSS Pulse Mode Enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NSSDRV</name>
            <description>NSS output enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMATEN</name>
            <description>Tx buffer DMA enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMAREN</name>
            <description>Rx buffer DMA enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>status register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
          <field>
            <name>TXLVL</name>
            <description>Tx FIFO level</description>
            <bitOffset>11</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXLVL</name>
            <description>Rx FIFO level</description>
            <bitOffset>9</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FERR</name>
            <description>Format Error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TRANS</name>
            <description>Transmitting ongoing Bit</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXORERR</name>
            <description>Reception Overrun Error Bit</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>CONFERR</name>
            <description>SPI Configuration error</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>CRCERR</name>
            <description>SPI CRC Error Bit</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXURERR</name>
            <description>Transmission underrun error bit</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>I2SCH</name>
            <description>I2S channel side</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TBE</name>
            <description>Transmit Buffer Empty</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RBNE</name>
            <description>Receive Buffer Not Empty</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DATA</name>
        <displayName>DATA</displayName>
        <description>data register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DATA</name>
            <description>Data register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CPCPOLY</name>
        <displayName>CPCPOLY</displayName>
        <description>CRC polynomial register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000007</resetValue>
        <fields>
          <field>
            <name>CRCPOLY</name>
            <description>CRC polynomial register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RCRC</name>
        <displayName>RCRC</displayName>
        <description>RX CRC register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>RCRC</name>
            <description>RX RCR register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TCRC</name>
        <displayName>TCRC</displayName>
        <description>TX CRC register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>TCRC</name>
            <description>Tx CRC register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>QCTL</name>
        <displayName>QCTL</displayName>
        <description>SPI quad wird control register</description>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0000</resetValue>
        <fields>
          <field>
            <name>IO23_DRV</name>
            <description>Drive IO2 and IO3 enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>QRD</name>
            <description>Quad wire read select</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>QMOD</name>
            <description>Quad wire mode enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
