burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral >
    <name>SPI0</name>
    <description>Serial Peripheral Interface 0</description>
    <baseAddress>0x40013000</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>SPI0</name>
      <value>21</value>
    </interrupt>
    <registers>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>control register 0</description>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>BDEN</name>
            <description>Bidirectional enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BDOEN</name>
            <description>Bidirectional Transmit output enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCEN</name>
            <description>Hardware CRC calculation enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCNT</name>
            <description>CRC transfer next</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FF16</name>
            <description>Data frame format</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RO</name>
            <description>Receive only</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWNSSEN</name>
            <description>NSS Software Mode Selection</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWNSS</name>
            <description>NSS Pin Selection In NSS Software Mode</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LF</name>
            <description>LSB First Mode</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPIEN</name>
            <description>SPI enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PSC</name>
            <description>Master Clock Prescaler Selection</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>MSTMOD</name>
            <description>Master Mode Enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKPL</name>
            <description>Clock Polarity Selection</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKPH</name>
            <description>Clock Phase Selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>control register 1</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TBEIE</name>
            <description>Transmit Buffer Empty Interrupt Enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RBNEIE</name>
            <description>Receive Buffer Not Empty Interrupt Enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIE</name>
            <description>Error interrupt enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMOD</name>
            <description>SPI TI Mode Enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NSSP</name>
            <description>SPI NSS Pulse Mode Enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NSSDRV</name>
            <description>NSS output enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMATEN</name>
            <description>Tx buffer DMA enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMAREN</name>
            <description>Rx buffer DMA enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>status register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
          <field>
            <name>FERR</name>
            <description>Format Error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TRANS</name>
            <description>Transmitting On-going Bit</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXORERR</name>
            <description>Reception Overrun Error Bit</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>CONFERR</name>
            <description>SPI Configuration error</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>CRCERR</name>
            <description>SPI CRC Error Bit</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TBE</name>
            <description>Transmit Buffer Empty</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RBNE</name>
            <description>Receive Buffer Not Empty</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DATA</name>
        <displayName>DATA</displayName>
        <description>data register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>DATA</name>
            <description>Data register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CPCPOLY</name>
        <displayName>CPCPOLY</displayName>
        <description>CRC polynomial register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000007</resetValue>
        <fields>
          <field>
            <name>CRCPOLY</name>
            <description>CRC polynomial register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RCRC</name>
        <displayName>RCRC</displayName>
        <description>RX CRC register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>RCRC</name>
            <description>RX RCR register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TCRC</name>
        <displayName>TCRC</displayName>
        <description>TX CRC register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <access>read-only</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>TCRC</name>
            <description>Tx CRC register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>I2SCTL</name>
        <displayName>I2SCTL</displayName>
        <description>I2S configuration register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>I2SSEL</name>
            <description>I2S mode selection</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2SEN</name>
            <description>I2S Enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2SOPMOD</name>
            <description>I2S configuration mode</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PCMSMOD</name>
            <description>PCM frame synchronization</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2SSTD</name>
            <description>I2S standard selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CKPL</name>
            <description>Idle state clock polarity</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DTLEN</name>
            <description>Data length to be transferred</description>
            <bitOffset>1</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CHLEN</name>
            <description>Channel length (number of bits per audio channel)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>I2SPSC</name>
        <displayName>I2SPSC</displayName>
        <description>I2S prescaler register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0002</resetValue>
        <fields>
          <field>
            <name>MCKOEN</name>
            <description>I2S_MCK output enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OF</name>
            <description>Odd factor for the prescaler</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIV</name>
            <description>Dividing factor for the prescaler</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
