burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral>
    <name>SYSCFG</name>
    <description>System and memory architectur</description>
    <groupName>SYSCFG</groupName>
    <baseAddress>0x40010000</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <registers>
      <register>
        <name>CFG0</name>
        <displayName>CFG0</displayName>
        <description>System configuration register 0</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PC14FMPEN</name>
            <description>I2C Fm+ mode on PC14 pin enable</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PA10FMPEN</name>
            <description>I2C Fm+ mode on PA10 pin enable</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PA9FMPEN</name>
            <description>I2C Fm+ mode on PA9 pin enable</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2C0_FMP</name>
            <description>Fast Mode Plus (FM+) enable for I2C0</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PB9FMPEN</name>
            <description>I2C Fm+ mode on PB9 pin enable</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PB8FMPEN</name>
            <description>I2C Fm+ mode on PB8 pin enable</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PB7FMPEN</name>
            <description>I2C Fm+ mode on PB7 pin enable</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PB6FMPEN</name>
            <description>I2C Fm+ mode on PB6 pin enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PA12_RMP</name>
            <description>PA12 pin remapping</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PA11_RMP</name>
            <description>PA11 pin remapping This bit is set and cleared by software. When set, it remaps the PA11 pin to operate as PA9 GPIO port, instead as PA11 GPIO port.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BOOT_MODE</name>
            <description>Boot mode (Refer to Boot configuration for details)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>EXTISS0</name>
        <displayName>EXTISS0</displayName>
        <description>EXTI sources selection register 0</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>EXTI3_SS</name>
            <description>EXTI 3 sources selection</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI2_SS</name>
            <description>EXTI 2 sources selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI1_SS</name>
            <description>EXTI 1 sources selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI0_SS</name>
            <description>EXTI 0 sources selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>EXTISS1</name>
        <displayName>EXTISS1</displayName>
        <description>EXTI sources selection register 1</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>EXTI7_SS</name>
            <description>EXTI 7 sources selection</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI6_SS</name>
            <description>EXTI 6 sources selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI5_SS</name>
            <description>EXTI 5 sources selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI4_SS</name>
            <description>EXTI 4 sources selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>EXTISS2</name>
        <displayName>EXTISS2</displayName>
        <description>EXTI sources selection register 2</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>EXTI11_SS</name>
            <description>EXTI 11 sources selection</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI10_SS</name>
            <description>EXTI 10 sources selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI9_SS</name>
            <description>EXTI 9 sources selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI8_SS</name>
            <description>EXTI 8 sources selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>EXTISS3</name>
        <displayName>EXTISS3</displayName>
        <description>EXTI sources selection register 3</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>EXTI15_SS</name>
            <description>EXTI 15 sources selection</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI14_SS</name>
            <description>EXTI 14 sources selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI13_SS</name>
            <description>EXTI 13 sources selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EXTI12_SS</name>
            <description>EXTI 12 sources selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CFG1</name>
        <displayName>CFG1</displayName>
        <description>System configuration register 1</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>SRAM_ECC_LOCK</name>
            <description>SRAM ECC check error lock</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LOCKUP_LOCK</name>
            <description>Cortex-M23 LOCKUP output lock</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>System status register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ECCSEIF</name>
            <description>SRAM single bit correction event flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ECCMEIF</name>
            <description>SRAM two bits non-correction event flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CFG2</name>
        <displayName>CFG2</displayName>
        <description>SYSCFG configuration register 2</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000007</resetValue>
        <fields>
          <field>
            <name>ECCEADDR</name>
            <description>Indicates the last ECC event on SRAM occurred.</description>
            <bitOffset>20</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ECCSERRBITS</name>
            <description>Indicates the error bit</description>
            <bitOffset>10</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ECCSEIE</name>
            <description>Single bit correction error interrupt enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ECCMEIE</name>
            <description>Multi-bits (two bits) non-correction error NMI interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HXTALCSS_IE</name>
            <description>HXTAL css interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LXTALCSS_IE</name>
            <description>LXTAL css interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CPU_IRQ_LAT</name>
        <displayName>CPU_IRQ_LAT</displayName>
        <description>IRQ latency register</description>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>IRQ_LATENCY</name>
            <description>IRQ_LATENCY specifies the minimum number of cycles between an interrupt that becomes pended in the NVIC, and the vector fetch for that interrupt being issued on the AHB-Lite interface.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMER0CFG0</name>
        <displayName>TIMER0CFG0</displayName>
        <description>TIMER0 configuration register 0</description>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TSCFG7</name>
            <description>Restart event mode configuration</description>
            <bitOffset>28</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG6</name>
            <description>External clock mode 0 configuration</description>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG5</name>
            <description>Event mode configuration</description>
            <bitOffset>20</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG4</name>
            <description>Pause mode configuration</description>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG3</name>
            <description>Restart mode configuration</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG2</name>
            <description>Quadrature decoder mode 2 configuration</description>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG1</name>
            <description>Quadrature decoder mode 1 configuration</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG0</name>
            <description>Quadrature decoder mode 0 configuration</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMER2CFG0</name>
        <displayName>TIMER2CFG0</displayName>
        <description>TIMER2 configuration register 0</description>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TSCFG7</name>
            <description>Restart event mode configuration</description>
            <bitOffset>28</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG6</name>
            <description>External clock mode 0 configuration</description>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG5</name>
            <description>Event mode configuration</description>
            <bitOffset>20</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG4</name>
            <description>Pause mode configuration</description>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG3</name>
            <description>Restart mode configuration</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG2</name>
            <description>Quadrature decoder mode 2 configuration</description>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG1</name>
            <description>Quadrature decoder mode 1 configuration</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TSCFG0</name>
            <description>Quadrature decoder mode 0 configuration</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMER0CFG1</name>
        <displayName>TIMER0CFG1</displayName>
        <description>TIMER0 configuration register 1</description>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TSCFG8</name>
            <description>Internal trigger input source configuration</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMER2CFG1</name>
        <displayName>TIMER2CFG1</displayName>
        <description>TIMER2 configuration register 1</description>
        <addressOffset>0x11C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TSCFG8</name>
            <description>Internal trigger input source configuration</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
