burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
          <field>
            <name>CH3COMCEN</name>
            <description>Channel 3 output compare clear enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3COMCTL</name>
            <description>Channel 3 compare output control</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>CH3COMSEN</name>
            <description>Channel 3 output compare shadow enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3MS</name>
            <description>Channel 3 mode selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH2COMCEN</name>
            <description>Channel 2 output compare clear enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2COMCTL</name>
            <description>Channel 2 compare output control</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>CH2COMSEN</name>
            <description>Channel 2 compare output shadow enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2MS</name>
            <description>Channel 2 I/O mode selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CHCTL1_Input</name>
        <displayName>CHCTL1_Input</displayName>
        <description>channel control register 1 (input mode) </description>
        <alternateRegister>CHCTL1_Output</alternateRegister>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CH3CAPFLT</name>
            <description>Channel 3 input capture filter control</description>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CH3CAPPSC</name>
            <description>Channel 3 input capture prescaler</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH3MS</name>
            <description>Channel 3 mode selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH2CAPFLT</name>
            <description>Channel 2 input capture filter control</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CH2CAPPSC</name>
            <description>Channel 2 input capture prescaler</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH2MS</name>
            <description>Channel 2 mode selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CHCTL2</name>
        <displayName>CHCTL2</displayName>
        <description>Channel control register 2</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CH4P</name>
            <description>Channel 4 capture/compare function polarity</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH4EN</name>
            <description>Channel 4 capture/compare function enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>

          <field>
            <name>CH3NP</name>
            <description>Channel3 complementary output polarity</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3P</name>
            <description>Channel 3 capture/compare function polarity</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3EN</name>
            <description>Channel 3 capture/compare function enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2NP</name>
            <description>Channel 2 complementary output polarity</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2NEN</name>
            <description>Channel 2 complementary output enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2P</name>
            <description>Channel 2 capture/compare function polarity</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2EN</name>
            <description>Channel 2 capture/compare function enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1NP</name>
            <description>Channel 1 complementary output polarity</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1NEN</name>
            <description>Channel 1 complementary output enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1P</name>
            <description>Channel 1 capture/compare function polarity</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1EN</name>
            <description>Channel 1 capture/compare function enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0NP</name>
            <description>Channel 0 complementary output polarity</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0NEN</name>
            <description>Channel 0 complementary output enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0P</name>
            <description>Channel 0 capture/compare function polarity</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0EN</name>
            <description>Channel 0 capture/compare function enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CNT</name>
        <displayName>CNT</displayName>
        <description>counter</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CNT</name>
            <description>current counter value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PSC</name>
        <displayName>PSC</displayName>
        <description>prescaler</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>PSC</name>
            <description>Prescaler value of the counter clock</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CAR</name>
        <displayName>CAR</displayName>
        <description>Counter auto reload register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CARL</name>
            <description>Counter auto reload value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CREP</name>
        <displayName>CREP</displayName>
        <description>Counter repetition register</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CREP</name>
            <description>Counter repetition value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH0CV</name>
        <displayName>CH0CV</displayName>
        <description>Channel 0 capture/compare value register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CH0VAL</name>
            <description>Capture or compare value of channel0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH1CV</name>
        <displayName>CH1CV</displayName>
        <description>Channel 1 capture/compare value register</description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CH1VAL</name>
            <description>Capture or compare value of channel1</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH2CV</name>
        <displayName>CH2CV</displayName>
        <description>Channel 2 capture/compare value register</description>
        <addressOffset>0x3C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CH2VAL</name>
            <description>Capture or compare value of channel 2</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH3CV</name>
        <displayName>CH3CV</displayName>
        <description>Channel 3 capture/compare value register</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CH3VAL</name>
            <description>Capture or compare value of channel 3</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCHP</name>
        <displayName>CCHP</displayName>
        <description>channel complementary protection register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>BRK1P</name>
            <description>BREAK1 input signal polarity</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRK1EN</name>
            <description>BREAK1 input signal enable</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRK1F</name>
            <description>BREAK1 input signal filter</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRK0F</name>
            <description>BREAK0 input signal filter</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>POEN</name>
            <description>Primary output enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OAEN</name>
            <description>Output automatic enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRKP</name>
            <description>BREAK input signal polarity</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRKEN</name>
            <description>BREAK input signal enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ROS</name>
            <description>Run mode off-state configure</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IOS</name>
            <description>Idle mode off-state configure</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PROT</name>
            <description>Complementary register protect control</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DTCFG</name>
            <description>Dead time configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DMACFG</name>
        <displayName>DMACFG</displayName>
        <description>DMA configuration register</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DMATC</name>
            <description>DMA transfer count</description>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DMATA</name>
            <description>DMA transfer access start address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DMATB</name>
        <displayName>DMATB</displayName>
        <description>DMA transfer buffer register</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>DMATB</name>
            <description>DMA transfer buffer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CHCTL3</name>
        <displayName>CHCTL3</displayName>
        <description>Channel control register 3</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CH4COMCTL_3</name>
            <description>Channel 4 compare output control </description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH4COMCEN</name>
            <description>Channel 4 output compare clear enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH4COMCTL</name>
            <description>Channel 4 compare output control </description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>CH4COMSEN</name>
            <description>Channel 4 compare output shadow enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH4COMFEN</name>
            <description>Channel 4 output compare fast enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH4CV</name>
        <displayName>CH4CV</displayName>
        <description>Channel 4 capture/compare value register</description>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CH4VAL</name>
            <description>Write CHxVAL register selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AFCTL0</name>
        <displayName>AFCTL0</displayName>
        <description>TIMERx alternate function control register 0</description>
        <addressOffset>0x5C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000003</resetValue>
        <fields>
          <field>
            <name>ETRSEL</name>
            <description>ETR source selection</description>
            <bitOffset>14</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>BRK0IN1P</name>
            <description>BREAK0 BRKIN1 alternate function input polarity</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRK0IN0P</name>
            <description>BREAK0 BRKIN0 alternate function input polarity</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRK0IN1EN</name>
            <description>BREAK0 BRKIN1 alternate function input enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRK0IN0EN</name>
            <description>BREAK0 BRKIN0 alternate function input enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>INSEL</name>
        <displayName>INSEL</displayName>
        <description>input selection register</description>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CI1_SEL</name>
            <description>TIMER0_CH1 input selection</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CI0_SEL</name>
            <description>TIMER0_CH0 input selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>Configuration register</description>
        <addressOffset>0xFC</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x0000</resetValue>
        <fields>
          <field>
            <name>CHVSEL</name>
            <description>Write CHxVAL register selection</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OUTSEL</name>
            <description>The output value selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
