burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
    </registers>
  </peripheral>
  <peripheral>
    <name>TIMER2</name>
    <description>General-level0-timers</description>
    <groupName>TIMER</groupName>
    <baseAddress>0x40000400</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>TIMER2</name>
      <value>27</value>
    </interrupt>
    <registers>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>control register 0</description>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CKDIV</name>
            <description>Clock division</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>ARSE</name>
            <description>Auto-reload shadow enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CAM</name>
            <description>Counter aligns mode selection</description>
            <bitOffset>5</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DIR</name>
            <description>Direction</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPM</name>
            <description>Single pulse mode</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UPS</name>
            <description>Update request source</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UPDIS</name>
            <description>Update disable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CEN</name>
            <description>Counter enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>control register 1</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TI0S</name>
            <description>Channel 0 trigger input selection</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MMC</name>
            <description>Master mode control</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DMAS</name>
            <description>DMA request source selection</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SMCFG</name>
        <displayName>SMCFG</displayName>
        <description>Slave mode configuration register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>ETP</name>
            <description>External trigger polarity</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMC1</name>
            <description>Part of SMC for enable External clock mode1</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ETPSC</name>
            <description>External trigger prescaler</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>ETFC</name>
            <description>External trigger filter control</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>MSM</name>
            <description>Master/Slave mode</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>

        </fields>
      </register>
      <register>
        <name>DMAINTEN</name>
        <displayName>DMAINTEN</displayName>
        <description>DMA and interrupt enable register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TRGDEN</name>
            <description>Trigger DMA request enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3DEN</name>
            <description>Channel 3 Capture/Compare DMA request enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2DEN</name>
            <description>Channel 2 Capture/Compare DMA request enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1DEN</name>
            <description>Channel 1 Capture/Compare DMA request enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0DEN</name>
            <description>Channel 0 Capture/Compare DMA request enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UPDEN</name>
            <description>Update DMA request enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRGIE</name>
            <description>Trigger interrupt enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3IE</name>
            <description>Channel 3 Capture/Compare interrupt enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2IE</name>
            <description>Channel 2 Capture/Compare interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1IE</name>
            <description>Channel 1 Capture/Compare interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0IE</name>
            <description>Channel 0 Capture/Compare interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UPIE</name>
            <description>Update Capture/Compare interrupt enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>INTF</name>
        <displayName>INTF</displayName>
        <description>interrupt flag register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CH3OF</name>
            <description>Channel 3 Capture overflow flag</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2OF</name>
            <description>Channel 2 Capture overflow flag</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1OF</name>
            <description>Channel 1 Capture overflow flag</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0OF</name>
            <description>Channel 0 Capture overflow flag</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRGIF</name>
            <description>Trigger interrupt flag</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3IF</name>
            <description>Channel 3 Capture/Compare interrupt enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2IF</name>
            <description>Channel 2 Capture/Compare interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1IF</name>
            <description>Channel 1 Capture/Compare interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0IF</name>
            <description>Channel 0 Capture/Compare interrupt flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UPIF</name>
            <description>Update interrupt flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SWEVG</name>
        <displayName>SWEVG</displayName>
        <description>event generation register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <access>write-only</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TRGG</name>
            <description>Trigger generation</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3G</name>
            <description>Channel 3 capture or compare event generation</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2G</name>
            <description>Channel 2 capture or compare event generation</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1G</name>
            <description>Channel 1 capture or compare event generation</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0G</name>
            <description>Channel 0 capture or compare event generation</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UPG</name>
            <description>Update generation</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CHCTL0_Output</name>
        <displayName>CHCTL0_Output</displayName>
        <description>Channel control register 0 (output mode)</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CH1COMCEN_3</name>
            <description>Channel 1 compare output control </description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0COMCTL_3</name>
            <description>Channel 0 compare output control </description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1COMCEN</name>
            <description>Channel 1 output compare clear enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1COMCTL</name>
            <description>Channel 1 output compare mode</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>CH1COMSEN</name>
            <description>Channel 1 output compare shadow enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1COMFEN</name>
            <description>Channel 1 output compare fast enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1MS</name>
            <description>Channel 1 mode selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH0COMCEN</name>
            <description>Channel 0 output compare clear enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0COMCTL</name>
            <description>Channel 0 compare output control</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>CH0COMSEN</name>
            <description>Channel 0 output compare shadow enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0COMFEN</name>
            <description>Channel 0 output compare fast enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0MS</name>
            <description>Channel 0 mode selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CHCTL0_Input</name>
        <displayName>CHCTL0_Input</displayName>
        <description>Channel control register 0 (input mode)</description>
        <alternateRegister>CHCTL0_Output</alternateRegister>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CH1CAPFLT</name>
            <description>Channel 1 input capture filter control</description>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CH1CAPPSC</name>
            <description>Channel 1 input capture prescaler</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH1MS</name>
            <description>Channel 1 mode selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH0CAPFLT</name>
            <description>Channel 0 input capture filter control</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CH0CAPPSC</name>
            <description>Channel 0 input capture prescaler</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH0MS</name>
            <description>Channel 0 mode selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CHCTL1_Output</name>
        <displayName>CHCTL1_Output</displayName>
        <description>Channel control register 1 (output mode)</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CH3COMCTL_3</name>
            <description>Channel 3 compare output control</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2COMCTL_3</name>
            <description>Channel 2 compare output control </description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3COMCEN</name>
            <description>Channel 3 output compare clear enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3COMCTL</name>
            <description>Channel 3 compare output control</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>CH3COMSEN</name>
            <description>Channel 3 compare output control</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3COMFEN</name>
            <description>Channel 3 output compare fast enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3MS</name>
            <description>Channel 3 mode selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH2COMCEN</name>
            <description>Channel 2 output compare clear enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2COMCTL</name>
            <description>Channel 2 compare output control</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>CH2COMSEN</name>
            <description>Channel 2 output compare shadow enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2COMFEN</name>
            <description>Channel 2 output compare fast enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2MS</name>
            <description>Channel 2 mode selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CHCTL1_Input</name>
        <displayName>CHCTL1_Input</displayName>
        <description>Channel control register 1 (input mode)</description>
        <alternateRegister>CHCTL1_Output</alternateRegister>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CH3CAPFLT</name>
            <description>Channel 3 input capture filter control</description>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CH3CAPPSC</name>
            <description>Channel 3 input capture prescaler</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH3MS</name>
            <description>Channel 3 mode selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH2CAPFLT</name>
            <description>Channel 2 input capture filter control</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CH2CAPPSC</name>
            <description>Channel 2 input capture prescaler</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CH2MS</name>
            <description>Channel 2 mode selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
