burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
      <register>
        <name>CHCTL2</name>
        <displayName>CHCTL2</displayName>
        <description>Channel control register 2</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CH3NP</name>
            <description>Channel 3 complementary output polarity</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3P</name>
            <description>Channel 3 polarity</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH3EN</name>
            <description>Channel 3 enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2NP</name>
            <description>Channel 2 complementary output polarity</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2P</name>
            <description>Channel 2 polarity</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH2EN</name>
            <description>Channel 2 enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1NP</name>
            <description>Channel 1 complementary output polarity</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1P</name>
            <description>Channel 1 polarity</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH1EN</name>
            <description>Channel 1 enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0NP</name>
            <description>Channel 0 complementary output polarity</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0P</name>
            <description>Channel 0 polarity</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CH0EN</name>
            <description>Channel 0 enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CNT</name>
        <displayName>CNT</displayName>
        <description>Counter register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CNT</name>
            <description>current counter value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PSC</name>
        <displayName>PSC</displayName>
        <description>Prescaler register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>PSC</name>
            <description>Prescaler value of the counter clock</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CAR</name>
        <displayName>CAR</displayName>
        <description>Counter auto reload register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CAR</name>
            <description>Low Auto-reload value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH0CV</name>
        <displayName>CH0CV</displayName>
        <description>Channel 0 capture/compare value register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CH0VAL</name>
            <description>Capture or compare value of channel 0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH1CV</name>
        <displayName>CH1CV</displayName>
        <description>Channel 1 capture/compare value register</description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CH1VAL</name>
            <description>Capture or compare value of channel 1</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH2CV</name>
        <displayName>CH2CV</displayName>
        <description>Channel 2 capture/compare value registerV</description>
        <addressOffset>0x3C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CH2VAL</name>
            <description>Capture or compare value of channel 2</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CH3CV</name>
        <displayName>CH3CV</displayName>
        <description>Channel 3 capture/compare value register</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CH3VAL</name>
            <description>Capture or compare value of channel 3</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DMACFG</name>
        <displayName>DMACFG</displayName>
        <description>DMA configuration register</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DMATC</name>
            <description>DMA transfer count</description>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>DMATA</name>
            <description>DMA transfer access start address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DMATB</name>
        <displayName>DMATB</displayName>
        <description>DMA Transfer buffer register</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>DMATB</name>
            <description>DMA transfer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>Configuration register</description>
        <addressOffset>0xFC</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>CHVSEL</name>
            <description>Write CHxVAL register selection</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
