burakenez/gd32c2x1-demo-suites-cmake-vscode/Projects/GD32C231C_EVAL/05_USART_HyperTerminal_Interrupt/GD32C231.svd
      <register>
        <name>TDATA</name>
        <displayName>TDATA</displayName>
        <description>Transmit data register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>TDATA</name>
            <description>Transmit data value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>9</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CHC</name>
        <displayName>CHC</displayName>
        <description> coherence control register</description>
        <addressOffset>0xC0</addressOffset>
        <size>0x20</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>EPERR</name>
            <description>Early parity error flag</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HCM</name>
            <description>Hardware flow control coherence mode</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RFCS</name>
        <displayName>RFCS</displayName>
        <description>USART receive FIFO control and status register</description>
        <addressOffset>0xD0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000400</resetValue>
        <fields>
          <field>
            <name>RFFINT</name>
            <description>Receive FIFO full interrupt flag</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RFCNT</name>
            <description>Receive FIFO count number</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RFF</name>
            <description>Receive FIFO full flag</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RFE</name>
            <description>Receive FIFO empty flag</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RFFIE</name>
            <description>Receive FIFO full interrupt enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RFEN</name>
            <description>Receive FIFO enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ELNACK</name>
            <description>Early NKEN when smartcard mode is selected</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
    </registers>
  </peripheral>
  <peripheral derivedFrom="USART1">
    <name>USART2</name>
    <description>Universal synchronous asynchronous receiver transmitter</description>
    <groupName>USART</groupName>
    <baseAddress>0x40004800</baseAddress>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x400</size>
      <usage>registers</usage>
    </addressBlock>
    <interrupt>
      <name>USART2</name>
      <value>16</value>
    </interrupt>

  </peripheral>
</peripherals>
</device>